export default {
  systemTitle: '植木善弘 Profile',
  banner: {
    title: '👋 こんにちは、Next.js スターターテンプレートへようこそ!',
    more: '詳細を見る',
  },

  firstName: '植木',
  lastName: '善弘',

  badgeTitle: '軽量で、すぐに使える 🎉',
  company: `💰 現在 {{companyName}} で働いています！`,
  companyName: '株式会社マネーフォワード',
  lastUpdated: '最終更新:',

  getStarted: '始める',

  featureList: [
    {
      title: '先進的な技術スタック',
      description: '効率的な React (v19) フレームワーク、Next.js、Nextra(v4)、Shadcn UIを使用してモダンなアプリケーションを構築',
    },
    {
      title: '国際化サポート (i18n)',
      description: '多言語サポートを内蔵し、アプリケーションの国際化を簡単に実現し、ユーザー層を拡大',
    },
    {
      title: 'TypeScript 型安全',
      description: 'TypeScriptを完全に統合し、静的型チェックを提供し、ランタイムエラーを減らし、コードの信頼性と保守性を向上',
    },
    {
      title: 'Iconify アイコンセット',
      description: '純CSSアイコン、Iconifyアイコンセットを統合し、豊富なアイコン選択を提供し、UIの視覚表現を強化',
    },
    {
      title: 'Tailwind CSS (v4)',
      description: '原子化CSSフレームワークTailwind CSSを使用し、効率的なデザインとレスポンシブUIを迅速に構築',
    },
    {
      title: 'コード規範',
      description: 'ベストプラクティスに従ったコード規範を採用し、ESLintを組み合わせてコード品質のチェックと一貫性を維持',
    },
    {
      title: 'ダークモード',
      description: 'ダークモードをサポートし、夜間の使用体験を向上',
    },
    {
      title: '豊富なコンポーネントと自由な拡張サポート',
      description: '豊富なプリセットコンポーネントを提供し、柔軟なカスタム拡張をサポート',
    },
    {
      title: '軽量設計',
      description: '軽量設計を採用し、プロジェクト設定を簡素化し、コンテンツ作成に集中',
    },
  ],
  featuresDesc: 'モダンなアプリケーションを簡単に構築し、開発プロセスを迅速に開始',
  faqs: [
    {
      question: 'このスターターテンプレートはどのフレームワークと技術スタックをサポートしていますか？',
      answer: 'このスターターテンプレートはNext.jsとNextraをサポートし、Tailwind CSS、Framer Motion、Shadcn UIコンポーネントなどのモダンな開発技術スタックを統合しています。',
    },
    {
      question: 'このテンプレートを使用して開発を始めるにはどうすればよいですか？',
      answer: 'GitHubリポジトリをクローンし、ドキュメントの手順に従ってインストールコマンドを実行するだけで、このテンプレートを使用して開発を始めることができます。',
    },
    {
      question: 'このテンプレートはどのようなタイプのプロジェクトに適していますか？',
      answer: 'このテンプレートは、企業サイト、個人ブログ、eコマースプラットフォームなど、迅速で効率的なモダンWebアプリケーションの作成に適しています。',
    },
    {
      question: 'プロジェクト内のコンポーネントを追加または変更するにはどうすればよいですか？',
      answer: '提供されているコンポーネントライブラリを使用し、ドキュメントの指示に従ってカスタマイズと拡張を行い、具体的なニーズに合わせることができます。',
    },
    {
      question: 'テンプレートは多言語サポートを提供していますか？',
      answer: 'はい、テンプレートには国際化 (i18n) 機能が内蔵されており、多言語コンテンツの追加と管理が簡単にでき、アプリケーションの国際ユーザー層を拡大できます。',
    },
    {
      question: '技術サポートやヘルプを得るにはどうすればよいですか？',
      answer: '使用中に問題が発生した場合は、GitHub @pdsuwwz を通じてご連絡ください。',
    },
  ],

}
